export type ContentGrid = Array<number | 'num' | 'date'>[]

export const contentGrid :ContentGrid = [
  [1, 2], // 物件番号
  [2, 2], // 取引態様
  [3, 2], // 取引状況

  [1, 5], // 物件種目
  [2, 5, 'num'], // 価格
  [3, 5],
  [5, 5, 'date'], // 築年月

  [2, 8], // 用途地域
  [3, 8, 'num'], // 建ぺい率
  [4, 8, 'num'], // 容積率

  [1, 10, 'num'], // 専有面積, 土地面積
  [2, 10, 'num'], // 建物面積, ㎡単価
  [3, 10, 'num'], // 坪単価
  [4, 10], // 接道状況
  [5, 10], // 接道１

  [1, 13], // 所在地
  [2, 13], // 建物名
  [3, 13], // 沿線駅
  [4, 13], // 商号
  [5, 13], // 電話番号

  [2, 19], // 所在階
  [3, 19], // 交通

  [2, 23], // 間取


];

